/* 

• Що таке об'єкт? Як створити об'єкт?
• Що таке властивість та метод, у чому різниця?
• Як додати властивість до об'єкта після його створення?
• Як перевірити, чи існує властивість в об'єкті?
*/

// Написати функцію рандома від 1 до 10













var name = "Julia";

function getRandomInt(min, max) {
    if (min > max) {
      throw new Error("min must be less than or equal to max");
    }
  
    return Math.floor(Math.random() * (max - min + 1)) + min;
  }
  
  // Приклад використання
  const randomNumber = getRandomInt(1, 10);
  
  console.log(`${name}, твій випадковий номер: ${randomNumber}`);

  // https://docs.google.com/presentation/d/1QDKJEIM9XxUz9OGWtZhoQ9HUXaigpLN19ptYSrOrv7s/edit?usp=sharing

/* 
Задача 1:

1 Створити об'єкт, який описує книгу (назва, автор, ISBN, рік публікації).
2 Створити об'єкт, який описує людину (ім'я, прізвище, вік, адреса).
3 Створити об'єкт, який описує кошик покупок (перелік продуктів, ціни, загальна сума).
4 Створити об'єкт, який описує автомобіль (модель, рік, двигун, колір).
5 Створити об'єкт, який описує музичний альбом (назву, артиста, рік, жанр).
6 Створити об'єкт, який описує продукт в інтернет-магазині (назву, ціна, опис, внаявності).
7 Створити об'єкт, який описує користувача веб-сайту (імя, імейл, пароль, номер телефону).
8 Створити об'єкт, який описує курс валют (USD, EUR, GBP, JPY).
9 Створити об'єкт, який описує студента (ім'я, вік, курс, адреса).
10 Створити об'єкт, який описує книгу (назва, автор, рік видання, жанр).

Задача 2:

Додайте метод до об'єкта, який виводить інформацію про нього.

Задача 3:

1 Отримайте список ключів у об'єкті.
2 Отримайте список значень у об'єкті.
3 Отримайте список ключ-значення у об'єкті.

*/
















const student = {
    name: 'Іван',
    age: 20,
    course: '3-й',
    getInfo: function() {
      console.log(`Ім'я: ${this.name}, Вік: ${this.age}, Курс: ${this.course}`);
    }
  };
  
  student.getInfo(); 

const studentEntries = Object.entries(student);
console.log(studentEntries);

// https://www.tiktok.com/@scrumlaunch/video/7328432388579593478